kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
#include "zigbee_app.h"

#include <errno.h>

#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/atomic.h>
#if defined(CONFIG_APP_BATTERY_REPORTING)
#include <zephyr/drivers/adc.h>
#endif

#include <zboss_api.h>
#include <zboss_api_addons.h>
#include <zb_mem_config_med.h>
#include <zigbee/zigbee_app_utils.h>
#include <zigbee/zigbee_error_handler.h>
#include <zb_nrf_platform.h>

#if IS_ENABLED(CONFIG_APP_HW_HFCLK_PROBE)
#include <hal/nrf_clock.h>
#endif

#include "battery_level.h"
#include "calibration.h"
#include "hw_pulse_counter.h"
#include "led_controller.h"
#include "metering_scale.h"
#include "nvs_store.h"
#include "zb_meter_ep.h"

LOG_MODULE_REGISTER(zigbee_app, LOG_LEVEL_INF);

/*
 * Endpoint 10 — same slot the ncs-zigbee samples land clusters on,
 * which makes Z2M's default cluster discovery just work. If we ever
 * grow a second endpoint (e.g. a Power Configuration cluster on its
 * own EP), pick 11 for it and keep this one metering-only.
 */
#define APP_ENDPOINT 10

/*
 * Design-doc defaults for the Metering cluster (see the "Zigbee model"
 * row): Multiplier=1, Divisor=1000 (imp/kWh), UnitOfMeasure=0 (kWh),
 * SummationFormatting=0 (no additional formatting hints — Z2M knows to
 * apply Divisor). MeteringDeviceType=0 = "Electric Metering".
 *
 * The pulse-count-to-kWh math lives in Z2M: kWh = raw_summation ×
 * Multiplier ÷ Divisor. On a 1000 imp/kWh meter the raw summation IS
 * the pulse count, and Divisor=1000 gives Z2M kWh directly. For a
 * different meter (say 800 imp/kWh), overwrite Divisor from Z2M — see
 * `Metering Divisor is runtime-writable` below.
 *
 * Multiplier is pinned to 1 (kept read-only via the stock ZBOSS
 * descriptor macros) and is not persisted. The only tuning knob is
 * Divisor.
 */
#define METERING_MULTIPLIER      1U
#define METERING_DEFAULT_DIVISOR CONFIG_APP_METERING_DEFAULT_IMP_PER_KWH
#define METERING_UNIT_KWH        ZB_ZCL_METERING_UNIT_OF_MEASURE_DEFAULT_VALUE  /* 0 = kWh */
#define METERING_SUMM_FORMATTING 0U
#define METERING_DEVICE_TYPE     0U  /* 0 = Electric Metering per SE 1.4 D.5.2.2.5.2 */

/*
 * Manufacturer-specific min-pulse-width filter attribute (issue #59
 * impl-2). Attribute ID 0xF000 sits in the manufacturer-specific range
 * of the Metering cluster's attribute space; manuf_code 0x1015 is
 * Nordic Semiconductor's Zigbee Alliance member ID. The pair uniquely
 * identifies our extension against any collision on the wire.
 *
 * Kept in the Metering cluster (rather than a new manufacturer cluster)
 * so a single external converter serves both the imp/kWh knob (#48) and
 * this one — reduces surface area, avoids a second endpoint cluster
 * declaration + its ZBOSS boilerplate.
 */
#define ZB_ZCL_ATTR_METERING_MIN_PULSE_WIDTH_US_ID  0xF000U
#define ZB_ZCL_MIN_PULSE_WIDTH_MANUF_CODE           0x1015U

/*
 * Basic-cluster identity strings. These are the fingerprint Z2M's
 * external converter matches on (`zigbeeModel` + manufacturer). Kept
 * short and stable — changing them after commissioning would strand
 * paired coordinators. `SW_BUILD_ID` is a free-form version string
 * — updated by the CI when we start tagging releases; today it
 * mirrors the branch state.
 */
#define BASIC_APP_VERSION      0x01
#define BASIC_STACK_VERSION    0x03  /* ZBOSS R23 */
#define BASIC_HW_VERSION       0x01
#define BASIC_MANUF_NAME       "kwood1992"
#define BASIC_MODEL_ID         "xiao-power-meter"
#define BASIC_DATE_CODE        "20260723"  /* commissioning start — see #5 */
#define BASIC_LOCATION_DESC    ""
#define BASIC_SW_BUILD_ID      "0.5.0"

struct zb_device_ctx {
	zb_zcl_basic_attrs_ext_t basic_attr;
	zb_zcl_identify_attrs_t identify_attr;

	/* Metering (0x0702) attribute storage. Manually broken out
	 * because we want the EXT variant of the ZBOSS attribute-list
	 * macro (adds Multiplier/Divisor) and its bundled struct
	 * `zb_zcl_metering_attrs_t` doesn't include those fields.
	 */
	zb_uint48_t metering_current_summation;
	zb_uint8_t  metering_status;
	zb_uint8_t  metering_unit_of_measure;
	zb_uint8_t  metering_summation_formatting;
	zb_uint8_t  metering_device_type;
	zb_uint24_t metering_multiplier;
	zb_uint24_t metering_divisor;

	/*
	 * Power Configuration (0x0001) — issue #8. Both are u8 on the wire:
	 * BatteryVoltage in 100 mV units, BatteryPercentageRemaining in
	 * 0.5 % units. Encoding lives in battery_level.c so it can be
	 * host-tested; these fields only ever hold the encoded value.
	 *
	 * Initialised to BATTERY_LEVEL_ZCL_UNKNOWN (0xFF) so a read taken
	 * before the first SAADC sample reports "unknown" rather than a
	 * plausible-looking flat battery.
	 */
	zb_uint8_t power_config_battery_voltage;
	zb_uint8_t power_config_battery_percentage;

	/* Manufacturer-specific min-pulse-width filter threshold in µs
	 * (issue #59 impl-2). ZCL type u16; Kconfig range 100-10000
	 * fits comfortably. Exposed under manuf_code 0x1015 (Nordic
	 * Semiconductor's Zigbee Alliance member ID) so a naive Z2M
	 * probe treats it as a Nordic-vendor extension. Attribute ID
	 * 0xF000 is inside the manufacturer-specific range.
	 */
	zb_uint16_t metering_min_pulse_width_us;

	/*
	 * Poll Control (0x0020) server attributes — issue #62 option B.
	 * All intervals are in QUARTER-SECONDS, per the ZCL spec; the
	 * app's own Kconfig values are in seconds / ms, so every
	 * assignment below goes through an explicit conversion.
	 *
	 * The *_min / *_max attributes are the floor/ceiling a client is
	 * allowed to write. Leaving them at 0 (the ZCL defaults) means
	 * "no client-imposed limit", which is what we want — we are not
	 * trying to stop a coordinator from tuning our poll cadence.
	 */
	zb_uint32_t poll_checkin_interval;
	zb_uint32_t poll_long_poll_interval;
	zb_uint16_t poll_short_poll_interval;
	zb_uint16_t poll_fast_poll_timeout;
	zb_uint32_t poll_checkin_interval_min;
	zb_uint32_t poll_long_poll_interval_min;
	zb_uint16_t poll_fast_poll_timeout_max;
};

static struct zb_device_ctx dev_ctx;

ZB_ZCL_DECLARE_IDENTIFY_ATTRIB_LIST(
	identify_attr_list,
	&dev_ctx.identify_attr.identify_time);

/* EXT variant adds manufacturer name, model ID, hardware/app/stack
 * version, date code, location description, physical environment and
 * software build ID — Z2M's fingerprint match keys off manufacturer
 * name + model ID. Without them the auto-generated definition has
 * `zigbeeModel: ['']` and no external converter can attach.
 */
ZB_ZCL_DECLARE_BASIC_ATTRIB_LIST_EXT(
	basic_attr_list,
	&dev_ctx.basic_attr.zcl_version,
	&dev_ctx.basic_attr.app_version,
	&dev_ctx.basic_attr.stack_version,
	&dev_ctx.basic_attr.hw_version,
	dev_ctx.basic_attr.mf_name,
	dev_ctx.basic_attr.model_id,
	dev_ctx.basic_attr.date_code,
	&dev_ctx.basic_attr.power_source,
	dev_ctx.basic_attr.location_id,
	&dev_ctx.basic_attr.ph_env,
	dev_ctx.basic_attr.sw_ver);

