kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
/*
 * Metering Divisor is runtime-writable (issue #48). The stock ZBOSS
 * macro `ZB_ZCL_DECLARE_METERING_ATTRIB_LIST_EXT` declares Divisor as
 * `ZB_ZCL_ATTR_ACCESS_READ_ONLY` (zb_zcl_metering.h:2438-2445), which
 * makes Z2M's attribute-write path return NOT_AUTHORIZED at the ZCL
 * layer — no callback fires, no persistence hook runs. Hand-roll the
 * attribute list so we can flip just Divisor to READ_WRITE using
 * `ZB_ZCL_SET_ATTR_DESC_M`. All other entries reuse the stock
 * descriptors so the access flags for CurrentSummationDelivered et al
 * stay identical to what the ncs-zigbee reference builds ship.
 *
 * Multiplier stays read-only intentionally: keeping the two-variable
 * `kWh = raw × Mult ÷ Div` simple by making only one of them tunable
 * (Divisor == imp/kWh) is a deliberate scope choice — see the issue.
 */
ZB_ZCL_START_DECLARE_ATTRIB_LIST_CLUSTER_REVISION(metering_attr_list,
						  ZB_ZCL_METERING)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_CURRENT_SUMMATION_DELIVERED_ID,
			     &dev_ctx.metering_current_summation)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_STATUS_ID,
			     &dev_ctx.metering_status)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_UNIT_OF_MEASURE_ID,
			     &dev_ctx.metering_unit_of_measure)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_SUMMATION_FORMATTING_ID,
			     &dev_ctx.metering_summation_formatting)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_METERING_DEVICE_TYPE_ID,
			     &dev_ctx.metering_device_type)
	/*
	 * InstantaneousDemand / DemandFormatting / HistoricalConsumption-
	 * Formatting are deliberately NOT declared.
	 *
	 * A pulse counter has no way to produce a meaningful instantaneous
	 * demand: between two pulses it knows only "no pulse yet", so any
	 * W figure would be a division by an open-ended interval that reads
	 * as zero while the load is small and spikes when a pulse lands.
	 * Publishing it meant Z2M exposed a `power` sensor that was
	 * permanently 0 — worse than absent, because HA graphs it.
	 *
	 * HA derives real power from the kWh series with a derivative
	 * helper, which is what the design doc specifies. All three are
	 * optional in SE 1.4 (DemandFormatting is only mandatory when
	 * InstantaneousDemand is present), so dropping them is spec-legal.
	 */
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_MULTIPLIER_ID,
			     &dev_ctx.metering_multiplier)
	ZB_ZCL_SET_ATTR_DESC_M(ZB_ZCL_ATTR_METERING_DIVISOR_ID,
			       &dev_ctx.metering_divisor,
			       ZB_ZCL_ATTR_TYPE_U24,
			       ZB_ZCL_ATTR_ACCESS_READ_WRITE)
	/*
	 * Manufacturer-specific min-pulse-width filter threshold (issue
	 * #59 impl-2). Kept in the Metering cluster's attribute list so
	 * the external converter can address it against the same cluster
	 * as the Divisor override — one converter, two knobs. The
	 * manuf_code (Nordic 0x1015) segregates it from any future
	 * Metering-cluster attribute ID collision.
	 */
	ZB_ZCL_SET_MANUF_SPEC_ATTR_DESC(
		ZB_ZCL_ATTR_METERING_MIN_PULSE_WIDTH_US_ID,
		ZB_ZCL_ATTR_TYPE_U16,
		ZB_ZCL_ATTR_ACCESS_READ_WRITE,
		ZB_ZCL_MIN_PULSE_WIDTH_MANUF_CODE,
		&dev_ctx.metering_min_pulse_width_us)
ZB_ZCL_FINISH_DECLARE_ATTRIB_LIST;

/*
 * Power Configuration server (0x0001) — issue #8.
 *
 * Hand-rolled rather than using ZB_ZCL_DECLARE_POWER_CONFIG_ATTRIB_LIST,
 * because that macro declares the BatterySize / BatteryQuantity /
 * BatteryRatedVoltage / BatteryAlarmMask / BatteryVoltageMinThreshold set
 * but NOT BatteryPercentageRemaining (0x0021) — which is the one Z2M maps
 * to the `battery` expose. Declaring only what we actually populate keeps
 * the simple descriptor small and avoids advertising attributes that
 * would read as zero forever.
 *
 * Both descriptors are hand-rolled with ZB_ZCL_SET_ATTR_DESC_M rather
 * than the stock ZB_SET_ATTR_DESCR_WITH_* macros, to add
 * ZB_ZCL_ATTR_ACCESS_REPORTING to BatteryVoltage.
 *
 * ZBOSS ships BatteryVoltage as plain READ_ONLY (zb_zcl_power_config.h
 * :477-484) — no reporting bit — while BatteryPercentageRemaining gets
 * READ_ONLY | REPORTING. Left as shipped, a coordinator can only read
 * voltage at interview time, so Z2M's `voltage` would show the value
 * captured during pairing and then never move. Since both are refreshed
 * by the same 5-minute SAADC sample, both are made reportable and the
 * endpoint reserves two extra reporting slots (see zb_meter_ep.h).
 *
 * Using SET_ATTR_DESC_M for both also sidesteps a comma trap: the
 * ZB_SET_ATTR_DESCR_WITH_* macros expand to a bare {...} initialiser and
 * do NOT supply their own separator, whereas SET_ATTR_DESC* do. Mixing
 * the two families in one list fails with "expected '}' before '{'".
 */
ZB_ZCL_START_DECLARE_ATTRIB_LIST_CLUSTER_REVISION(power_config_attr_list,
						  ZB_ZCL_POWER_CONFIG)
	ZB_ZCL_SET_ATTR_DESC_M(ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_VOLTAGE_ID,
			       &dev_ctx.power_config_battery_voltage,
			       ZB_ZCL_ATTR_TYPE_U8,
			       ZB_ZCL_ATTR_ACCESS_READ_ONLY |
				       ZB_ZCL_ATTR_ACCESS_REPORTING)
	ZB_ZCL_SET_ATTR_DESC_M(ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_PERCENTAGE_REMAINING_ID,
			       &dev_ctx.power_config_battery_percentage,
			       ZB_ZCL_ATTR_TYPE_U8,
			       ZB_ZCL_ATTR_ACCESS_READ_ONLY |
				       ZB_ZCL_ATTR_ACCESS_REPORTING)
ZB_ZCL_FINISH_DECLARE_ATTRIB_LIST;

/*
 * Poll Control server (#62 option B). Declaring this cluster is what
 * flips zigbee-herdsman from "fail the write after 10 s" to "queue the
 * write and flush it on the device's next check-in" — herdsman defaults
 * a genPollCtrl device's pendingRequestTimeout to one check-in interval
 * (1 day if it hasn't read ours yet), then answers our Check-In with
 * startFastPolling=1 whenever it has something pending for us.
 *
 * ZBOSS starts the check-in process on its own during ZCL periodic-
 * activity init when a Poll Control SERVER cluster is present, so there
 * is no explicit zb_zcl_poll_control_start() call here.
 *
 * The macro also declares a hidden `srv_cfg_data_ctx_<name>` holding the
 * bound client's addr/endpoint (ADDR_DATA attribute) — that's why the
 * attribute list is declared here rather than being hand-rolled.
 */
ZB_ZCL_DECLARE_POLL_CONTROL_ATTRIB_LIST(
	poll_control_attr_list,
	&dev_ctx.poll_checkin_interval,
	&dev_ctx.poll_long_poll_interval,
	&dev_ctx.poll_short_poll_interval,
	&dev_ctx.poll_fast_poll_timeout,
	&dev_ctx.poll_checkin_interval_min,
	&dev_ctx.poll_long_poll_interval_min,
	&dev_ctx.poll_fast_poll_timeout_max);

ZB_DECLARE_METER_CLUSTER_LIST(
	app_clusters,
	basic_attr_list,
	power_config_attr_list,
	identify_attr_list,
	metering_attr_list,
	poll_control_attr_list);

ZB_DECLARE_METER_EP(
	app_ep,
	APP_ENDPOINT,
	app_clusters);

ZBOSS_DECLARE_DEVICE_CTX_1_EP(
	app_ctx,
	app_ep);

