kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
static bool joined;
static bool endpoint_registered;

/*
 * The current effective Divisor (imp/kWh), kept in sync with the
 * ZCL attribute table. Two roles:
 *   - Compare-against-previous when a Z2M attribute write arrives, so
 *     a rejected out-of-range write can be rolled back without
 *     re-parsing the packed u24 attribute value.
 *   - Debug logging so a "why is Z2M reading 0.5 kWh instead of 1?"
 *     can be answered from the console.
 * Populated from NVS (or CONFIG_APP_METERING_DEFAULT_IMP_PER_KWH on
 * cold boot) inside metering_attrs_init(), then updated by the ZCL
 * device callback on every accepted Divisor write.
 */
static uint32_t effective_divisor;

#if defined(CONFIG_APP_BATTERY_REPORTING)
/*
 * Battery sampling (#8).
 *
 * Split across two contexts on purpose:
 *   - battery_sample() does the blocking SAADC conversion in the CALLER's
 *     context (the report work queue), where blocking is fine.
 *   - battery_write_attributes() runs on the ZBOSS thread from the report
 *     callback and only touches the ZCL attribute table.
 *
 * Doing the conversion on the ZBOSS thread would block the stack's
 * scheduler for the acquisition window, which is the kind of thing that
 * shows up later as a missed poll rather than an obvious failure.
 *
 * Declared here rather than next to those functions because
 * power_config_attrs_init() (further up) needs the spec at init time.
 */
static const struct adc_dt_spec battery_adc =
	ADC_DT_SPEC_GET(DT_PATH(zephyr_user));

static uint8_t pending_battery_voltage = BATTERY_LEVEL_ZCL_UNKNOWN;
static uint8_t pending_battery_percentage = BATTERY_LEVEL_ZCL_UNKNOWN;
#endif

/* Set by zigbee_app_start_join() (Zephyr thread context) and cleared by
 * the ZBOSS signal handler on ZB_BDB_SIGNAL_STEERING (ZBOSS thread
 * context) — an atomic keeps the two-thread hand-off honest. Only
 * user-initiated joins get LED feedback; stack-internal auto-rejoin
 * after ZB_ZDO_SIGNAL_LEAVE stays silent so a coordinator restart
 * in the middle of the night doesn't blink a mounted meter.
 */
static atomic_t user_join_in_flight = ATOMIC_INIT(0);

/*
 * After a successful join (steering) or a successful re-attach
 * (device_reboot), set the steady-state long-poll interval and start
 * turbo poll for the Z2M interview window. Turbo poll runs at ~100 ms
 * cadence for its timeout and auto-reverts to the long-poll interval
 * on expiry — no separate leave callback required.
 *
 * ZBOSS API note: zb_zdo_pim_set_long_poll_interval is only valid
 * AFTER join; during steering the interval snaps back to the default
 * (5 s). That's why this runs from the signal handler, not init.
 */
static void apply_sleepy_poll_intervals_if_joined(zb_ret_t status)
{
	if (!IS_ENABLED(CONFIG_APP_ZIGBEE_SLEEPY_ED) || status != RET_OK) {
		return;
	}

	/*
	 * Push the Poll Control attributes into the PIM.
	 *
	 * ncs-zigbee's docs/known_issues.rst (KRKNWK, "Apply Poll Control
	 * values loaded from NVRAM to the PIM") documents that ZBOSS does
	 * NOT do this itself: the attribute values survive a reboot in
	 * NVRAM, but nothing pushes them at the Poll Interval Manager, so
	 * without this the device silently reverts to the ZBOSS default
	 * 5 s long poll after a re-attach. The workaround in that doc is
	 * exactly this block, hoisted here so it covers both the fresh-join
	 * (STEERING) and re-attach (DEVICE_REBOOT) call sites.
	 *
	 * Reading back through the attribute table rather than using the
	 * Kconfig values directly is the point — if a coordinator has
	 * written LongPollInterval, the table holds its value and the PIM
	 * must follow it.
	 */
	zb_zcl_attr_t *attr_desc;
	zb_uint32_t long_poll_qs = 0;

	attr_desc = zb_zcl_get_attr_desc_a(APP_ENDPOINT,
					   ZB_ZCL_CLUSTER_ID_POLL_CONTROL,
					   ZB_ZCL_CLUSTER_SERVER_ROLE,
					   ZB_ZCL_ATTR_POLL_CONTROL_LONG_POLL_INTERVAL_ID);
	if (attr_desc != NULL) {
		long_poll_qs = ZB_ZCL_GET_ATTRIBUTE_VAL_32(attr_desc);
		zb_zdo_pim_set_long_poll_interval(
			ZB_QUARTERECONDS_TO_MSEC(long_poll_qs));
	}

	/*
	 * Deliberately NOT pushing ShortPollInterval / FastPollTimeout at
	 * the PIM, even though known_issues.rst's snippet does. Those two
	 * setters (zb_zdo_pim_set_fast_poll_interval / _timeout) are not in
	 * ncs-zigbee v1.3.0's public headers — that snippet is written
	 * against ZBOSS internals behind ZB_USE_INTERNAL_HEADERS. The
	 * fast-poll path is driven by the Poll Control cluster from its own
	 * attributes anyway; only the long-poll interval needs the manual
	 * nudge above, which is also the only one the doc's rationale
	 * (NVRAM restore not reaching the PIM) actually applies to.
	 */

	/* Still open a turbo-poll window for Z2M's interview reads — the
	 * first check-in is one whole check-in interval away, far too late
	 * to cover commissioning.
	 */
	zb_zdo_pim_start_turbo_poll_continuous(
		CONFIG_APP_ZIGBEE_JOIN_TURBO_POLL_MS);

	LOG_INF("sleepy ED: long_poll=%u ms (from attr), turbo_poll_window=%d ms",
		(unsigned)ZB_QUARTERECONDS_TO_MSEC(long_poll_qs),
		CONFIG_APP_ZIGBEE_JOIN_TURBO_POLL_MS);
}

/*
 * HFCLK anchor probe for the 2026-07-29 hunt (#8). The 1.65 mA settled
 * baseline looks like "CPU System-ON idle, HFCLK on" from the datasheet;
 * this probe confirms whether HFCLK is actually running post-join by
 * reading the peripheral status registers directly. If HFCLKSTAT=0 and
 * HFCLKRUN=0 in the settled state, the anchor is somewhere other than
 * HFCLK. If HFCLKRUN=1 the next question is which stack holds the
 * refcount — see docs/working/2026-07-29-hfclk-anchor-hunt.md.
 *
 * Piggy-backs on the same call sites as the rx-idle probe (boot,
 * post-steering, post-reboot-reattach, 60 s tick).
 */
#if IS_ENABLED(CONFIG_APP_HW_HFCLK_PROBE)

/*
 * TIMER0-4 register snapshot + running-vs-stopped probe.
 *
 * MODE=0 (Timer, not Counter) + timer actually counting is what anchors
 * PCLK16M and keeps HFCLK on HFINT. INTENSET alone doesn't answer the
 * running question — a driver can leave IRQs disabled while using
 * events via PPI or shortcuts, so INTENSET=0 does NOT mean stopped.
 *
 * To detect running, do two back-to-back TASKS_CAPTURE hits into CC[5]
 * and log the delta. Non-zero delta → timer is running RIGHT NOW.
 * CC[5] is the least-likely CC slot to conflict with a driver's use
 * (they typically use CC[0..2]); still a soft assumption.
 *
 * The nRF52840 has TIMER0-4 as separate peripheral instances at
 * distinct base addresses; iterate via an array of pointers.
 */
static NRF_TIMER_Type * const app_timers[] = {
	NRF_TIMER0, NRF_TIMER1, NRF_TIMER2, NRF_TIMER3, NRF_TIMER4,
};

static void log_timer_status(const char *where)
{
	for (size_t i = 0; i < ARRAY_SIZE(app_timers); i++) {
		NRF_TIMER_Type *t = app_timers[i];
		uint32_t v1, v2;

		t->TASKS_CAPTURE[5] = 1;
		v1 = t->CC[5];
		t->TASKS_CAPTURE[5] = 1;
		v2 = t->CC[5];

		LOG_INF("timer probe [%s]: T%u MODE=%u BITMODE=%u PRESCALER=%u INTENSET=0x%08x CC5_delta=%u running=%d",
			where, (unsigned)i,
			(unsigned)t->MODE,
			(unsigned)t->BITMODE,
			(unsigned)t->PRESCALER,
			(unsigned)t->INTENSET,
			(unsigned)(v2 - v1),
			(v2 != v1) ? 1 : 0);
	}
}

static void log_hfclk_status(const char *where)
{
	bool xtal_running = nrf_clock_hf_is_running(
		NRF_CLOCK, NRF_CLOCK_HFCLK_HIGH_ACCURACY);
	uint32_t hfclkstat = NRF_CLOCK->HFCLKSTAT;
	uint32_t hfclkrun = NRF_CLOCK->HFCLKRUN;

