kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
	LOG_INF("hfclk probe [%s]: HFCLKSTAT=0x%08x HFCLKRUN=0x%08x xtal_running=%d",
		where, hfclkstat, hfclkrun, xtal_running ? 1 : 0);
	log_timer_status(where);
}

#else /* !CONFIG_APP_HW_HFCLK_PROBE */

static inline void log_hfclk_status(const char *where) { ARG_UNUSED(where); }

#endif /* CONFIG_APP_HW_HFCLK_PROBE */

/*
 * Diagnostic probe for issue #51 / #8-blocker-1: does ZBOSS clobber our
 * zb_set_rx_on_when_idle(FALSE) setting post-join? Sample the current
 * value at boot, after each signal event, and on a 60 s tick — under the
 * hypothesis that a sleepy ED is silently reverting to rx-on-when-idle
 * once it enters steady state, which would explain the 12.4 mA baseline
 * seen in the 2026-07-29 INA219 run.
 *
 * Gated on CONFIG_APP_ZIGBEE_RX_IDLE_PROBE so production builds don't
 * emit these lines. Enabled by rtt.conf. Also acts as the tick+kick
 * carrier for the HFCLK probe above (selected via Kconfig).
 */
#if IS_ENABLED(CONFIG_APP_ZIGBEE_RX_IDLE_PROBE)

#define RX_IDLE_PROBE_INTERVAL K_SECONDS(60)

static void rx_idle_probe_work_handler(struct k_work *work);
static K_WORK_DELAYABLE_DEFINE(rx_idle_probe_work, rx_idle_probe_work_handler);

static void log_rx_on_when_idle(const char *where)
{
	zb_bool_t rx_on = zb_get_rx_on_when_idle();

	LOG_INF("rx-on-when-idle probe [%s]: %s (joined=%d)",
		where, rx_on ? "TRUE" : "FALSE", joined ? 1 : 0);
}

static void rx_idle_probe_work_handler(struct k_work *work)
{
	ARG_UNUSED(work);
	log_rx_on_when_idle("tick");
	log_hfclk_status("tick");
	k_work_reschedule(&rx_idle_probe_work, RX_IDLE_PROBE_INTERVAL);
}

static void rx_idle_probe_kick(const char *where)
{
	log_rx_on_when_idle(where);
	log_hfclk_status(where);
	k_work_reschedule(&rx_idle_probe_work, RX_IDLE_PROBE_INTERVAL);
}

#else /* !CONFIG_APP_ZIGBEE_RX_IDLE_PROBE */

static inline void log_rx_on_when_idle(const char *where) { ARG_UNUSED(where); }
static inline void rx_idle_probe_kick(const char *where) { ARG_UNUSED(where); }

#endif /* CONFIG_APP_ZIGBEE_RX_IDLE_PROBE */

/*
 * ZBOSS calls this from its main loop on every stack event.
 *
 * ALWAYS delegate to `zigbee_default_signal_handler` regardless of
 * signal type, then free the buffer. See memory
 * `project_r23_signal_handler_must_delegate.md` for why — skipping
 * the default handler on FIRST_START breaks Z2M's ZDO interview
 * silently. The switch below is just for logging + local `joined`
 * state tracking; no early returns.
 */
void zboss_signal_handler(zb_bufid_t bufid)
{
	zb_zdo_app_signal_hdr_t *sg_p;
	zb_zdo_app_signal_type_t sig = zb_get_app_signal(bufid, &sg_p);
	zb_ret_t status = ZB_GET_APP_SIGNAL_STATUS(bufid);

	switch (sig) {
	case ZB_BDB_SIGNAL_STEERING:
		joined = (status == RET_OK);
		LOG_INF("network steering: %s (status=%d)",
			joined ? "joined" : "failed", status);
		if (joined) {
			rx_idle_probe_kick("post-steering");
		}

		/* Only paint the outcome if a user-initiated join was in
		 * flight — auto-rejoin after ZB_ZDO_SIGNAL_LEAVE fires
		 * the same signal and must stay silent (issue #29).
		 */
		if (atomic_cas(&user_join_in_flight, 1, 0)) {
			led_cancel(LED_PATTERN_JOINING);
			if (status == RET_OK) {
				led_request(LED_PATTERN_JOIN_SUCCESS,
					    LED_PRIO_JOIN_SUCCESS);
			} else {
				led_request(LED_PATTERN_JOIN_FAIL,
					    LED_PRIO_JOIN_FAIL);
			}
		}
		apply_sleepy_poll_intervals_if_joined(status);
		break;

	case ZB_BDB_SIGNAL_DEVICE_REBOOT:
		/* Reboot that re-attached to the saved network in NVRAM (no
		 * fresh steering). Sleepy poll intervals aren't persisted, so
		 * re-apply them here. No LED — there was no user-initiated
		 * join event on this path.
		 */
		if (status == RET_OK) {
			LOG_INF("device reboot: reattached to saved network");
			joined = true;
			rx_idle_probe_kick("post-reboot-reattach");
		}
		apply_sleepy_poll_intervals_if_joined(status);
		break;

	case ZB_ZDO_SIGNAL_LEAVE:
		LOG_WRN("left network");
		joined = false;
		break;

	default:
		break;
	}

	ZB_ERROR_CHECK(zigbee_default_signal_handler(bufid));
	if (bufid) {
		zb_buf_free(bufid);
	}
}

/* ZCL expresses every Poll Control interval in quarter-seconds. */
#define QS_FROM_SEC(s)  ((zb_uint32_t)(s) * 4U)
#define QS_FROM_MS(ms)  ((zb_uint32_t)(ms) / 250U)

/*
 * Seed the Poll Control attributes from the app's Kconfig (#62 option B).
 *
 * These become the single source of truth for poll cadence. Before this
 * cluster existed, apply_sleepy_poll_intervals_if_joined() pushed the
 * Kconfig values straight at the PIM; now the attribute table holds them
 * and the PIM is driven *from* the attributes, so a coordinator that
 * writes LongPollInterval actually changes behaviour instead of being
 * silently overwritten on the next join. That was the conflict flagged as
 * a risk on the ticket.
 */
static void poll_control_attrs_init(void)
{
	dev_ctx.poll_checkin_interval =
		QS_FROM_SEC(CONFIG_APP_ZIGBEE_CHECKIN_INTERVAL_S);
	dev_ctx.poll_long_poll_interval =
		QS_FROM_MS(CONFIG_APP_ZIGBEE_LONG_POLL_INTERVAL_MS);
	dev_ctx.poll_fast_poll_timeout =
		(zb_uint16_t)QS_FROM_SEC(CONFIG_APP_ZIGBEE_FAST_POLL_TIMEOUT_S);

	/* Short poll is the cadence used *during* a fast-poll window. The
	 * ZCL default (2 qs = 500 ms) is slower than the 100 ms turbo poll
	 * the button path uses, but it only runs for fast_poll_timeout and
	 * herdsman needs just a few round-trips to drain its queue.
	 */
	dev_ctx.poll_short_poll_interval =
		ZB_ZCL_POLL_CONTROL_SHORT_POLL_INTERVAL_DEFAULT_VALUE;

	/* 0 = "no client-imposed floor/ceiling". We deliberately don't
	 * restrict what a coordinator may write; if Z2M wants to check in
	 * more often it's welcome to, and the battery cost is its own
	 * (see the Kconfig help).
	 */
	dev_ctx.poll_checkin_interval_min =
		ZB_ZCL_POLL_CONTROL_CHECKIN_MIN_INTERVAL_DEFAULT_VALUE;
	dev_ctx.poll_long_poll_interval_min =
		ZB_ZCL_POLL_CONTROL_LONG_POLL_MIN_INTERVAL_DEFAULT_VALUE;
	dev_ctx.poll_fast_poll_timeout_max =
		ZB_ZCL_POLL_CONTROL_FAST_POLL_MAX_TIMEOUT_DEFAULT_VALUE;

	LOG_INF("poll control: checkin=%u s, fast_poll_timeout=%u s, long_poll=%u ms",
		CONFIG_APP_ZIGBEE_CHECKIN_INTERVAL_S,
		CONFIG_APP_ZIGBEE_FAST_POLL_TIMEOUT_S,
		CONFIG_APP_ZIGBEE_LONG_POLL_INTERVAL_MS);
}

