kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
static void metering_attrs_init(void)
{
	/* CurrentSummationDelivered — starts at 0; replaced by whatever
	 * NVS persisted before we finish booting, then live-updated as
	 * pulses come in.
	 */
	ZB_ASSIGN_UINT48(dev_ctx.metering_current_summation, 0, 0);

	dev_ctx.metering_status = 0;                 /* no fault flags */
	dev_ctx.metering_unit_of_measure = METERING_UNIT_KWH;
	dev_ctx.metering_summation_formatting = METERING_SUMM_FORMATTING;
	dev_ctx.metering_device_type = METERING_DEVICE_TYPE;

	/* InstantaneousDemand is no longer declared at all — see the
	 * attribute-list comment above for why a pulse counter can't
	 * produce one honestly.
	 */

	/* Multiplier / Divisor. Both are u24 in the wire representation
	 * (packed structs on nRF, low+high halves). Use the ZBOSS
	 * helper that converts a u32 into the packed u24 — writing the
	 * halves by hand is easy to get wrong and the helper is free.
	 *
	 * Multiplier is pinned to 1 (design-doc default; the only tuning
	 * knob is Divisor).
	 *
	 * Divisor comes from NVS if a Z2M write has previously been
	 * persisted; otherwise falls back to the compile-time default.
	 * A value in NVS that has fallen out of range (e.g., a firmware
	 * that used to accept a wider range wrote something we now
	 * reject) is treated the same as no value — surface the fallback
	 * via a warning so the installer notices, but don't refuse to
	 * boot.
	 */
	zb_uint32_to_uint24(METERING_MULTIPLIER, &dev_ctx.metering_multiplier);

	uint32_t divisor = METERING_DEFAULT_DIVISOR;
	uint32_t nvs_val = 0;
	int rc = nvs_store_load_imp_per_kwh(&nvs_val);

	if (rc == 0) {
		if (calibration_is_valid_imp_per_kwh(nvs_val)) {
			divisor = nvs_val;
			/* Name the compile-time default alongside the active
			 * value when they differ. A persisted calibration
			 * survives factory reset by design (it describes the
			 * meter, not the pairing), so "why is my kWh 25 %
			 * out?" is otherwise only answerable by reading the
			 * Divisor attribute back over the air.
			 */
			if (divisor != (uint32_t)METERING_DEFAULT_DIVISOR) {
				LOG_INF("Metering Divisor: imp/kWh=%u (from NVS; "
					"compile-time default is %u — calibration "
					"override is active)",
					(unsigned)divisor,
					(unsigned)METERING_DEFAULT_DIVISOR);
			} else {
				LOG_INF("Metering Divisor: imp/kWh=%u (from NVS)",
					(unsigned)divisor);
			}
		} else {
			LOG_WRN("NVS imp/kWh=%u out of range [%u..%u] — "
				"using compile-time default %u",
				(unsigned)nvs_val,
				CALIBRATION_IMP_PER_KWH_MIN,
				CALIBRATION_IMP_PER_KWH_MAX,
				(unsigned)divisor);
		}
	} else if (rc == -ENOENT) {
		LOG_INF("Metering Divisor: imp/kWh=%u (compile-time default; "
			"nothing persisted yet)",
			(unsigned)divisor);
	} else {
		LOG_ERR("nvs_store_load_imp_per_kwh failed: %d — using default %u",
			rc, (unsigned)divisor);
	}

	effective_divisor = divisor;
	zb_uint32_to_uint24(divisor, &dev_ctx.metering_divisor);

	/*
	 * Manufacturer-specific min-pulse-width filter threshold (#59
	 * impl-2). The active TIMER3.CC[0] value was already programmed
	 * by hw_pulse_counter_init() from the same NVS slot; we just
	 * need to mirror it into the ZCL attribute so a Z2M read reflects
	 * the running value. Do the load again (cheap) so this table
	 * stays authoritative even if the load order swaps in future.
	 */
	uint32_t min_width_us = CONFIG_APP_PULSE_MIN_WIDTH_US;
	uint32_t nvs_width = 0;
	int rc_width = nvs_store_load_pulse_min_width_us(&nvs_width);

	if (rc_width == 0 &&
	    calibration_is_valid_pulse_min_width_us(nvs_width)) {
		min_width_us = nvs_width;
	}
	dev_ctx.metering_min_pulse_width_us = (zb_uint16_t)min_width_us;
}

/*
 * Power Configuration (0x0001) initial values — issue #8.
 *
 * Both start at the ZCL 0xFF "unknown" sentinel rather than 0. A
 * coordinator that reads the cluster between join and the first report
 * tick then sees "no reading yet" instead of a flat battery, which would
 * otherwise fire HA's low-battery automations on every re-pair.
 */
static void power_config_attrs_init(void)
{
	dev_ctx.power_config_battery_voltage = BATTERY_LEVEL_ZCL_UNKNOWN;
	dev_ctx.power_config_battery_percentage = BATTERY_LEVEL_ZCL_UNKNOWN;

#if defined(CONFIG_APP_BATTERY_REPORTING)
	if (!adc_is_ready_dt(&battery_adc)) {
		LOG_ERR("battery ADC %s not ready — battery will report unknown",
			battery_adc.dev ? battery_adc.dev->name : "(null)");
		return;
	}

	int err = adc_channel_setup_dt(&battery_adc);

	if (err != 0) {
		LOG_ERR("battery ADC channel setup failed: %d", err);
		return;
	}

	LOG_INF("battery reporting enabled: %u mV = 0%%, %u mV = 100%%",
		(unsigned)CONFIG_APP_BATTERY_EMPTY_MV,
		(unsigned)CONFIG_APP_BATTERY_FULL_MV);
#else
	LOG_INF("battery reporting disabled at build time — "
		"Power Config cluster will report unknown");
#endif
}

static void app_clusters_attr_init(void)
{
	/* Basic cluster (0x0000). ZCL_VERSION populated from header;
	 * power source declared as battery — a sleepy ED on AAA
	 * signals its polling model that way, which changes Z2M's
	 * expected report cadence (poll- rather than push-heavy).
	 * Bench-USB power is still declared as battery because that's
	 * the target power model.
	 */
	dev_ctx.basic_attr.zcl_version = ZB_ZCL_VERSION;
	dev_ctx.basic_attr.app_version = BASIC_APP_VERSION;
	dev_ctx.basic_attr.stack_version = BASIC_STACK_VERSION;
	dev_ctx.basic_attr.hw_version = BASIC_HW_VERSION;
	dev_ctx.basic_attr.power_source = ZB_ZCL_BASIC_POWER_SOURCE_BATTERY;
	dev_ctx.basic_attr.ph_env = ZB_ZCL_BASIC_ENV_UNSPECIFIED;

	/* ZCL strings are length-prefixed (Pascal-style): first byte is
	 * the length excluding the terminator. `ZB_ZCL_SET_STRING_VAL`
	 * writes both the prefix and the payload; `ZB_ZCL_STRING_CONST_SIZE`
	 * is the compile-time strlen minus trailing NUL.
	 */
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.mf_name,
			      BASIC_MANUF_NAME,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_MANUF_NAME));
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.model_id,
			      BASIC_MODEL_ID,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_MODEL_ID));
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.date_code,
			      BASIC_DATE_CODE,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_DATE_CODE));
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.location_id,
			      BASIC_LOCATION_DESC,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_LOCATION_DESC));
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.sw_ver,
			      BASIC_SW_BUILD_ID,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_SW_BUILD_ID));

	/* Identify cluster (0x0003). Default identify time = 0 =
	 * device is NOT currently identifying.
	 */
	dev_ctx.identify_attr.identify_time =
		ZB_ZCL_IDENTIFY_IDENTIFY_TIME_DEFAULT_VALUE;

	power_config_attrs_init();
	metering_attrs_init();
	poll_control_attrs_init();
}

