kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
static void factory_reset_cb(zb_uint8_t param)
{
	ARG_UNUSED(param);
	LOG_WRN("ZBOSS thread: invoking zb_bdb_reset_via_local_action");
	joined = false;
	zb_bdb_reset_via_local_action(0);
}

/*
 * Short-press wake (#62). Restarting turbo poll on an already-joined
 * device only changes the poll cadence — join state, bindings and the
 * attribute table are all untouched, which is what the acceptance
 * criteria require. ZBOSS reverts to the long-poll interval when the
 * window expires, so there's nothing to tear down afterwards.
 */
static void wake_turbo_poll_cb(zb_uint8_t param)
{
	ARG_UNUSED(param);
	zb_zdo_pim_start_turbo_poll_continuous(
		CONFIG_APP_ZIGBEE_WAKE_TURBO_POLL_MS);
	LOG_INF("ZBOSS thread: wake turbo-poll window open for %d ms",
		CONFIG_APP_ZIGBEE_WAKE_TURBO_POLL_MS);
}

/*
 * Trampoline that runs on the ZBOSS thread and does the actual
 * `ZB_ZCL_SET_ATTRIBUTE` call. The publish API packs the pulse total
 * into a scheduler-callback-sized u8 index via a shadow variable —
 * `param` is only 8 bits so we can't pass the 48-bit summation
 * through it directly.
 */
static uint64_t pending_summation_total;

static void write_summation_attribute(uint64_t pulse_total)
{
	struct metering_u48 v = metering_scale_to_u48(pulse_total);
	zb_uint48_t summation;

	ZB_ASSIGN_UINT48(summation, v.high, v.low);

	/* Persist into the attribute table AND mark for reporting.
	 * `ZB_FALSE` on check_access means the write skips the ZCL
	 * read-only access check — required because the summation
	 * attribute is declared read-only (external writers must go
	 * through the ZCL API, but on-device app code goes direct).
	 */
	ZB_ZCL_SET_ATTRIBUTE(
		APP_ENDPOINT,
		ZB_ZCL_CLUSTER_ID_METERING,
		ZB_ZCL_CLUSTER_SERVER_ROLE,
		ZB_ZCL_ATTR_METERING_CURRENT_SUMMATION_DELIVERED_ID,
		(zb_uint8_t *)&summation,
		ZB_FALSE);
}

/*
 * Explicit ZCL Report Attributes frame for CurrentSummationDelivered.
 * Runs on the ZBOSS thread. Bypasses the reporting engine's delta gate
 * — see the zigbee_app.h comment on publish_summation_and_report for
 * the rationale (issue #20).
 *
 * Two failure modes we intentionally log but recover from:
 *   * No reporting slot for the attribute yet — coordinator hasn't
 *     sent ConfigureReporting since our last join, or we booted before
 *     Z2M finished interviewing. Frame can't be built without a
 *     destination; skip and let the reporting engine try again next
 *     tick.
 *   * No free OUT buffer. ZBOSS's buffer pool is small; a report on
 *     top of an already-pending report can transiently starve. Skip
 *     and rely on the next tick.
 */
static void send_explicit_summation_report(void)
{
	zb_zcl_reporting_info_t *rep_info = zb_zcl_find_reporting_info(
		APP_ENDPOINT,
		ZB_ZCL_CLUSTER_ID_METERING,
		ZB_ZCL_CLUSTER_SERVER_ROLE,
		ZB_ZCL_ATTR_METERING_CURRENT_SUMMATION_DELIVERED_ID);

	if (rep_info == NULL) {
		LOG_WRN("no reporting slot for CurrentSummationDelivered — "
			"coordinator ConfigureReporting not seen yet");
		return;
	}

	LOG_INF("reporting slot: min_interval=%us max_interval=%us "
		"reportable_change=0x%04x%08x",
		rep_info->u.send_info.min_interval,
		rep_info->u.send_info.max_interval,
		rep_info->u.send_info.delta.u48.high,
		rep_info->u.send_info.delta.u48.low);

	zb_bufid_t bufid = zb_buf_get_out();

	if (bufid == 0) {
		LOG_WRN("no free OUT buffer for explicit summation report");
		return;
	}

	zb_zcl_send_report_attr_command(rep_info, bufid);
}

#if defined(CONFIG_APP_BATTERY_REPORTING)
static int battery_read_mv(uint16_t *out_mv)
{
	int16_t raw = 0;
	struct adc_sequence sequence = {
		.buffer = &raw,
		.buffer_size = sizeof(raw),
	};

	int err = adc_sequence_init_dt(&battery_adc, &sequence);

	if (err != 0) {
		return err;
	}

	err = adc_read(battery_adc.dev, &sequence);
	if (err != 0) {
		return err;
	}

	int32_t mv = raw;

	err = adc_raw_to_millivolts_dt(&battery_adc, &mv);
	if (err != 0) {
		return err;
	}

	/* Single-ended conversions can land slightly negative on noise near
	 * zero; clamp rather than wrapping through the unsigned cast.
	 */
	if (mv < 0) {
		mv = 0;
	}
	if (mv > UINT16_MAX) {
		mv = UINT16_MAX;
	}
	*out_mv = (uint16_t)mv;
	return 0;
}

static void battery_sample(void)
{
	uint16_t mv = 0;
	int err = battery_read_mv(&mv);

	if (err != 0) {
		/* Report "unknown" rather than a stale or zero reading —
		 * a plausible-looking 0 % would trigger low-battery
		 * automations in HA on what is actually a driver fault.
		 */
		LOG_WRN("battery SAADC read failed: %d — reporting unknown", err);
		pending_battery_voltage = BATTERY_LEVEL_ZCL_UNKNOWN;
		pending_battery_percentage = BATTERY_LEVEL_ZCL_UNKNOWN;
		return;
	}

	uint8_t percent = battery_level_percent(mv,
						CONFIG_APP_BATTERY_EMPTY_MV,
						CONFIG_APP_BATTERY_FULL_MV);

	pending_battery_voltage = battery_level_zcl_voltage(mv);
	pending_battery_percentage = battery_level_zcl_percentage(percent);

	LOG_INF("battery: %u mV -> %u%% (zcl volt=%u pct=%u)",
		(unsigned)mv, (unsigned)percent,
		(unsigned)pending_battery_voltage,
		(unsigned)pending_battery_percentage);
}

static void battery_write_attributes(void)
{
	ZB_ZCL_SET_ATTRIBUTE(
		APP_ENDPOINT,
		ZB_ZCL_CLUSTER_ID_POWER_CONFIG,
		ZB_ZCL_CLUSTER_SERVER_ROLE,
		ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_VOLTAGE_ID,
		&pending_battery_voltage,
		ZB_FALSE);

	ZB_ZCL_SET_ATTRIBUTE(
		APP_ENDPOINT,
		ZB_ZCL_CLUSTER_ID_POWER_CONFIG,
		ZB_ZCL_CLUSTER_SERVER_ROLE,
		ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_PERCENTAGE_REMAINING_ID,
		&pending_battery_percentage,
		ZB_FALSE);
}
#endif /* CONFIG_APP_BATTERY_REPORTING */

static void publish_summation_cb(zb_uint8_t param)
{
	ARG_UNUSED(param);

	write_summation_attribute(pending_summation_total);
}

static void publish_summation_and_report_cb(zb_uint8_t param)
{
	ARG_UNUSED(param);

	write_summation_attribute(pending_summation_total);
#if defined(CONFIG_APP_BATTERY_REPORTING)
	/* Battery attributes are written before the summation report goes
	 * out so a coordinator that reads the endpoint in response to the
	 * report sees the same tick's battery value, not the previous one.
	 */
	battery_write_attributes();
#endif
	send_explicit_summation_report();
}

void zigbee_app_start_join(void)
{
	LOG_INF("starting network steering");
	/* Mark this steering as user-initiated so the signal handler
	 * paints the outcome (see zboss_signal_handler). The blue-blink
	 * request goes in here so the LED shows intent immediately —
	 * a stack-internal steering that hasn't been requested by the
	 * app never sets this flag and never asks for the LED.
	 */
	atomic_set(&user_join_in_flight, 1);
	led_request(LED_PATTERN_JOINING, LED_PRIO_JOINING);
	ZB_SCHEDULE_APP_CALLBACK(start_steering_cb, 0);
}

void zigbee_app_factory_reset(void)
{
	LOG_WRN("factory reset — leaving network and erasing NVS");
	ZB_SCHEDULE_APP_CALLBACK(factory_reset_cb, 0);
}

bool zigbee_app_is_joined(void)
{
	return joined;
}

void zigbee_app_wake_for_write(void)
{
	if (!IS_ENABLED(CONFIG_APP_ZIGBEE_SLEEPY_ED)) {
		/* Radio is already always-on; downlinks arrive immediately
		 * and there is no poll cadence to shorten.
		 */
		LOG_INF("wake request ignored — not a sleepy ED");
		return;
	}
	if (!joined) {
		/* zb_zdo_pim_* addresses the parent, and without an
		 * association there isn't one. The button dispatch routes
		 * this case to JOIN instead, so reaching here means the
		 * device dropped its parent between classify and dispatch.
		 */
		LOG_WRN("wake request ignored — not joined");
		return;
	}

	LOG_INF("wake for write: requesting %d ms turbo-poll window",
		CONFIG_APP_ZIGBEE_WAKE_TURBO_POLL_MS);
	ZB_SCHEDULE_APP_CALLBACK(wake_turbo_poll_cb, 0);
}

void zigbee_app_publish_summation(uint64_t pulse_total)
{
	if (!endpoint_registered) {
		/* zigbee_app_init() failed or hasn't run yet — nothing
		 * to publish into. Silent no-op keeps main.c's sample
		 * loop from having to gate its call site on Zigbee
		 * bring-up state.
		 */
		return;
	}

	/* Hand off to the ZBOSS thread. `pending_summation_total` is
	 * a single-writer/single-reader shadow, and back-to-back calls
	 * will collapse into whichever value the ZBOSS thread reads
	 * last — that's actually the behaviour we want (report the
	 * freshest total, not a queue of stale ones).
	 */
	pending_summation_total = pulse_total;
	ZB_SCHEDULE_APP_CALLBACK(publish_summation_cb, 0);
}

void zigbee_app_publish_summation_and_report(uint64_t pulse_total)
{
	if (!endpoint_registered) {
		return;
	}

#if defined(CONFIG_APP_BATTERY_REPORTING)
	/* Blocking SAADC conversion, deliberately done here in the caller's
	 * (work-queue) context rather than inside the ZBOSS callback — see
	 * the battery_sample() comment. This is the design doc's "5-min RTC
	 * wake to report + sample battery": one conversion per report tick,
	 * on a wake the device was making anyway.
	 */
	battery_sample();
#endif

	pending_summation_total = pulse_total;
	ZB_SCHEDULE_APP_CALLBACK(publish_summation_and_report_cb, 0);
}
